import 'package:flutter/material.dart';

class StateEngine {
  static final Map<String, List<String>> digitalState = {
    'التموين والإمداد': ['سوبر ماركت', 'مخازن الجملة', 'سوق الخضار', 'مخابز'],
    'الخدمات المالية': ['شحن رصيد', 'تسديد فواتير', 'تحويل داخلي', 'محفظة الضمان'],
    'الرعاية الطبية': ['مستشفيات', 'صيدليات مناوبة', 'مختبرات', 'عيادات تخصصية'],
    'التعليم والمهارات': ['جامعات', 'مدارس', 'معاهد تقنية', 'منصات تدريب'],
    'السياحة والترفيه': ['فنادق', 'قاعات أعراس', 'مطاعم وكافيهات', 'استراحات'],
    'الإنشاءات والعقارات': ['أراضي وفلل', 'مواد بناء', 'مقاولات', 'استشارات هندسية'],
    'سوق العمل': ['وظائف شاغرة', 'طلب توظيف', 'أعمال حرة'],
  };
}
